vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.36" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="https://raw.githubusercontent.com/Open-CMSIS-Pack/Open-CMSIS-Pack-Spec/v1.7.36/schema/PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32C0xx_DFP</name>
  <description overview="Documents/OVERVIEW.md">STMicroelectronics STM32C0 Series Device Support</description>
  <url>https://www.keil.com/pack/</url>
  <repository type="git">https://github.com/Open-CMSIS-Pack/STM32C0xx_DFP.git</repository>
  <license>LICENSE</license>
  <licenseSets>
    <licenseSet id="all" default="true" gating="true">
      <license title="Apache-2.0 License for CMSIS add-ons" name="LICENSE" spdx="Apache-2.0"/>
    </licenseSet>
  </licenseSets>

  <releases>
    <release version="2.3.0" date="2025-09-10" tag="v2.3.0">
      Updated debug configuration files
      Updated documentation references
      Updated Templates:
      - Added DWARF-5 debug information
      - Added generated output files
      Package Description (pdsc):
      - Shortened device family description
      - Added documentation for subfamilies STM32C051/91/92
    </release>
    <release version="2.2.0" date="2025-03-19" tag="v2.2.0">
      Package Description (pdsc):
       - Added devices STM32C071FBPx and STM32C071FBPxN
      Device support:
      - Updated Flash algorithm project and *.FLM files
      - Updated SVD
    </release>
    <release version="2.1.0" date="2024-12-18" tag="v2.1.0">
      Package Description (pdsc):
       - Added STM32C051/91/92 subfamilies
      Device support:
      - Added Flashloader for 256K devices
      - Updated SVD fiels for STM32C011/31 devices
      - Added SVD files for STM32C051/91/92 devices
    </release>
    <release version="2.0.0" date="2024-10-16" tag="v2.0.0">
      Updated for new CMSIS-Toolbox CubeMX integration
      Removed CMSIS VIO Driver
      Removed STM32CubeMX_FW_C0
      Removed board drivers (Basic I/O, ...)
      Removed all examples
      Updated SVD files
      Removed previous generator (gpdsc)
      Added new global generator
      Package Description (pdsc):
      - Removed Device:Startup component
      - Removed Device:STM32Cube HAL components
      - Removed Device:STM32Cube LL components
      - Removed Board descriptions
      - Removed BSP components
      - Removed compile device header from device description
      - Removed unused conditions
      - Replaced documentation files with permalinks
      - Added LICENSE file
      - Added STM32C071 subfamily
      Device support:
      - Added Flashloader for 128K and 64K devices
      - Added SVD file for STM32C07xx devices
    </release>
    <release version="1.0.0" date="2023-01-12">
      Initial version of STM32C0 Device Family Pack for use with:
      - STM32CubeMX 6.7.0
      - STM32Cube C0 Firmware Package V1.0.0
      Board Support support and examples for boards STM32C0116-DK, STM32C0316-DK.
    </release>
  </releases>

  <keywords>
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32C0</keyword>
    <keyword>STM32C0xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32C0 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M0+" DcoreVersion="r0p1" Dclock="48000000" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dendian="Little-endian"/>

      <book name="https://developer.arm.com/documentation/dui0662/latest" title="Cortex-M0+ Generic User Guide"/>

      <description>
High-performance STM32C0 MCUs with Arm Cortex-M0+ core, MPU, frequency up to 48 MHz.
      </description>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            Sequence("CheckID");
          </block>
        </sequence>

        <sequence name="DebugCoreStart">
          <block>
            // Replication of Standard Functionality
            Write32(0xE000EDF0, 0xA05F0001);                                        // Enable Core Debug via DHCSR
          </block>

          <block info="DbgMCU registers">
            // Device Specific Debug Setup
            Write32(0x4002103C, Read32(0x4002103C) | 0x08000000);                   // Set RCC_APBENR1.DBGEN

            Write32(0x40015804, DbgMCU_CR);                                         // DBGMCU_CR: Configure MCU Debug
            Write32(0x40015808, DbgMCU_APB_Fz1);                                    // DBGMCU_APB_FZ1: Configure APB Freeze Behavior
            Write32(0x4001580C, DbgMCU_APB_Fz2);                                    // DBGMCU_APB_FZ2: Configure APB Freeze Behavior
          </block>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>

      </sequences>

      <!-- ************************  Subfamily 'STM32C011'  **************************** -->
      <subFamily DsubFamily="STM32C011">
        <debug svd="CMSIS/SVD/STM32C011.svd"/>
        <compile define="STM32C011xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0490-stm32c0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf"  title="STM32C0x1 Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32c011d6.pdf" title="STM32C011x4/x6 Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32C0x1.dbgconf" version="1.0.1">
          // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00201803;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00078800;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32C011F6Ux'  ***************************** -->
        <device Dname="STM32C011F6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="20"/>
        </device>

