vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
        <!-- *************************  Device 'STM32C011F6UxTR'  ***************************** -->
        <device Dname="STM32C011F6UxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C011D6YxTR'  ***************************** -->
        <device Dname="STM32C011D6YxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="CSP" n="12"/>
        </device>

        <!-- *************************  Device 'STM32C011F6Px'  ***************************** -->
        <device Dname="STM32C011F6Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C011J6Mx'  ***************************** -->
        <device Dname="STM32C011J6Mx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <!--feature type="SON" n="8"/-->
          <feature type="PackageOther" n="8" name="SON"/>
        </device>

        <!-- ################################### 16 KB ################################## -->
        <!-- *************************  Device 'STM32C011F4Ux'  ***************************** -->
        <device Dname="STM32C011F4Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C011F4UxTR'  ***************************** -->
        <device Dname="STM32C011F4UxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C011F4Px'  ***************************** -->
        <device Dname="STM32C011F4Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C011J4Mx'  ***************************** -->
        <device Dname="STM32C011J4Mx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00001800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <!--feature type="SON" n="8"/-->
          <feature type="PackageOther" n="8" name="SON"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32C031'  **************************** -->
      <subFamily DsubFamily="STM32C031">
        <debug svd="CMSIS/SVD/STM32C031.svd"/>
        <compile define="STM32C031xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0490-stm32c0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf"  title="STM32C0x1 Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32c031c4.pdf" title="STM32C031x4/x6 Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32C0x1.dbgconf" version="1.0.1">
          // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00201803;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00078800;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32C031C6Tx'  ***************************** -->
        <device Dname="STM32C031C6Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C031C6Ux'  ***************************** -->
        <device Dname="STM32C031C6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

