vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
        <!-- *************************  Device 'STM32C031K6Tx'  ***************************** -->
        <device Dname="STM32C031K6Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C031K6Ux'  ***************************** -->
        <device Dname="STM32C031K6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C031G6Ux'  ***************************** -->
        <device Dname="STM32C031G6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C031F6Px'  ***************************** -->
        <device Dname="STM32C031F6Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- ################################### 16 KB ################################## -->
        <!-- *************************  Device 'STM32C031C4Ux'  ***************************** -->
        <device Dname="STM32C031C4Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C031C4Tx'  ***************************** -->
        <device Dname="STM32C031C4Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C031K4Tx'  ***************************** -->
        <device Dname="STM32C031K4Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C031K4Ux'  ***************************** -->
        <device Dname="STM32C031K4Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C031G4Ux'  ***************************** -->
        <device Dname="STM32C031G4Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="QFP" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C031F4Px'  ***************************** -->
        <device Dname="STM32C031F4Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00004000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_16.FLM"  start="0x08000000" size="0x00004000" default="1" />
          <feature type="SOP" n="20"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32C051'  **************************** -->
      <subFamily DsubFamily="STM32C051">
        <debug svd="CMSIS/SVD/STM32C051.svd"/>
        <compile define="STM32C051xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0490-stm32c0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf"  title="STM32C0x1 Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32c051c6.pdf" title="STM32C051 Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32C0x1.dbgconf" version="1.0.1">
          // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00201803;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00078800;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32C051C8Tx'  ***************************** -->
        <device Dname="STM32C051C8Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C051C8Ux'  ***************************** -->
        <device Dname="STM32C051C8Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C051K8Tx'  ***************************** -->
        <device Dname="STM32C051K8Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

