vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
        <!-- *************************  Device 'STM32C051G8Ux'  ***************************** -->
        <device Dname="STM32C051G8Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C051F8Px'  ***************************** -->
        <device Dname="STM32C051F8Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C051D8YxTR'  ***************************** -->
        <device Dname="STM32C051D8YxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="CSP" n="14"/>
        </device>

        <!-- ################################### 32 KB ################################## -->
        <!-- *************************  Device 'STM32C051C6Tx'  ***************************** -->
        <device Dname="STM32C051C6Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C051C6Ux'  ***************************** -->
        <device Dname="STM32C051C6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C051K6Tx'  ***************************** -->
        <device Dname="STM32C051K6Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C051K6Ux'  ***************************** -->
        <device Dname="STM32C051K6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C051G6Ux'  ***************************** -->
        <device Dname="STM32C051G6Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C051F6Px'  ***************************** -->
        <device Dname="STM32C051F6Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00008000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00003000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_32.FLM"  start="0x08000000" size="0x00008000" default="1" />
          <feature type="SOP" n="20"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32C071'  **************************** -->
      <subFamily DsubFamily="STM32C071">
        <debug svd="CMSIS/SVD/STM32C071.svd"/>
        <compile define="STM32C071xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0490-stm32c0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf"  title="STM32C0x1 Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32c071kb.pdf" title="STM32C071x8/xB Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32C0x1.dbgconf" version="1.0.1">
          // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00201803;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00078800;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <!-- ################################### 128 KB ################################# -->
        <!-- *************************  Device 'STM32C071RBTx'  ***************************** -->
        <device Dname="STM32C071RBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C071CBTx'  ***************************** -->
        <device Dname="STM32C071CBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071CBUx'  ***************************** -->
        <device Dname="STM32C071CBUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

