vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
        <!-- *************************  Device 'STM32C071KBTx'  ***************************** -->
        <device Dname="STM32C071KBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071KBUx'  ***************************** -->
        <device Dname="STM32C071KBUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071GBUx'  ***************************** -->
        <device Dname="STM32C071GBUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C071FBYxTR'  ***************************** -->
        <device Dname="STM32C071FBYxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="CSP" n="19"/>
        </device>

        <!-- *************************  Device 'STM32C071FBPx'  ***************************** -->
        <device Dname="STM32C071FBPx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="SOP" n="20"/>
        </device>
        <!-- *************************  Device 'STM32C071FBPxN'  ***************************** -->
        <device Dname="STM32C071FBPxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C071RBTxN'  ***************************** -->
        <device Dname="STM32C071RBTxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C071RBIxN'  ***************************** -->
        <device Dname="STM32C071RBIxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C071CBTxN'  ***************************** -->
        <device Dname="STM32C071CBTxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071CBUxN'  ***************************** -->
        <device Dname="STM32C071CBUxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071KBTxN'  ***************************** -->
        <device Dname="STM32C071KBTxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071KBUxN'  ***************************** -->
        <device Dname="STM32C071KBUxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071GBUxN'  ***************************** -->
        <device Dname="STM32C071GBUxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- ################################### 64 KB ################################## -->
        <!-- *************************  Device 'STM32C071R8Tx'  ***************************** -->
        <device Dname="STM32C071R8Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

