vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
        <!-- *************************  Device 'STM32C071C8Tx'  ***************************** -->
        <device Dname="STM32C071C8Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071C8Ux'  ***************************** -->
        <device Dname="STM32C071C8Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071K8Tx'  ***************************** -->
        <device Dname="STM32C071K8Tx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071K8Ux'  ***************************** -->
        <device Dname="STM32C071K8Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071G8Ux'  ***************************** -->
        <device Dname="STM32C071G8Ux">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C071F8Px'  ***************************** -->
        <device Dname="STM32C071F8Px">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- *************************  Device 'STM32C071R8TxN'  ***************************** -->
        <device Dname="STM32C071R8TxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C071C8TxN'  ***************************** -->
        <device Dname="STM32C071C8TxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071C8UxN'  ***************************** -->
        <device Dname="STM32C071C8UxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C071K8TxN'  ***************************** -->
        <device Dname="STM32C071K8TxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071K8UxN'  ***************************** -->
        <device Dname="STM32C071K8UxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C071G8UxN'  ***************************** -->
        <device Dname="STM32C071G8UxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C071F8PxN'  ***************************** -->
        <device Dname="STM32C071F8PxN">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00010000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00006000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_64.FLM"  start="0x08000000" size="0x00010000" default="1" />
          <feature type="SOP" n="20"/>
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32C091'  **************************** -->
      <subFamily DsubFamily="STM32C091">
        <debug svd="CMSIS/SVD/STM32C091.svd"/>
        <compile define="STM32C091xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0490-stm32c0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf"  title="STM32C0x1 Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32c091cb.pdf" title="STM32C091 Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32C0x1.dbgconf" version="1.0.1">
          // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00201803;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00078800;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32C091RCTx'  ***************************** -->
        <device Dname="STM32C091RCTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

