vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
        <!-- *************************  Device 'STM32C091ECYxTR'  ***************************** -->
        <device Dname="STM32C091ECYxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="CSP" n="24"/>
        </device>

        <!-- *************************  Device 'STM32C091RCIx'  ***************************** -->
        <device Dname="STM32C091RCIx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C091CCTx'  ***************************** -->
        <device Dname="STM32C091CCTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C091CCUx'  ***************************** -->
        <device Dname="STM32C091CCUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C091KCTx'  ***************************** -->
        <device Dname="STM32C091KCTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C091KCUx'  ***************************** -->
        <device Dname="STM32C091KCUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C091GCUx'  ***************************** -->
        <device Dname="STM32C091GCUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C091FCPx'  ***************************** -->
        <device Dname="STM32C091FCPx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32C091RBTx'  ***************************** -->
        <device Dname="STM32C091RBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C091CBTx'  ***************************** -->
        <device Dname="STM32C091CBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C091CBUx'  ***************************** -->
        <device Dname="STM32C091CBUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C091KBTx'  ***************************** -->
        <device Dname="STM32C091KBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C091KBUx'  ***************************** -->
        <device Dname="STM32C091KBUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C091GBUx'  ***************************** -->
        <device Dname="STM32C091GBUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" init="0 "/>
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C091FBPx'  ***************************** -->
        <device Dname="STM32C091FBPx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1 "/>
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00009000" default="1" init="0 "/>
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1 "/>
          <feature type="SOP" n="20"/>
        </device>
      </subFamily>

