vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Keil.STM32C0xx_DFP.pdsc
      <!-- ************************  Subfamily 'STM32C092'  **************************** -->
      <subFamily DsubFamily="STM32C092">
        <debug svd="CMSIS/SVD/STM32C092.svd"/>
        <compile define="STM32C092xx"/>

        <book name="https://www.st.com/resource/en/reference_manual/rm0490-stm32c0x1-advanced-armbased-32bit-mcus-stmicroelectronics.pdf"  title="STM32C0x1 Reference Manual"/>
        <book name="https://www.st.com/resource/en/datasheet/stm32c091cb.pdf" title="STM32C092 Datasheet"/>

        <debugvars configfile="CMSIS/Debug/STM32C0x1.dbgconf" version="1.0.1">
          // Default values for variables in debug sequences are configured with a *.dbgconf file in the user project
          __var DbgMCU_CR        = 0x00000006;   // DBGMCU_CR:       DBGMCU configuration register
          __var DbgMCU_APB_Fz1   = 0x00201803;   // DBGMCU_APB_FZ1:  DBGMCU APB freeze register 1
          __var DbgMCU_APB_Fz2   = 0x00078800;   // DBGMCU_APB_FZ2:  DBGMCU APB freeze register 2
        </debugvars>

        <!-- ################################### 256 KB ################################## -->
        <!-- *************************  Device 'STM32C092RCTx'  ***************************** -->
        <device Dname="STM32C092RCTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C092ECYxTR'  ***************************** -->
        <device Dname="STM32C092ECYxTR">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="CSP" n="24"/>
        </device>

        <!-- *************************  Device 'STM32C092RCIx'  ***************************** -->
        <device Dname="STM32C092RCIx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="BGA" n="64"/>
        </device>

        <!-- *************************  Device 'STM32C092CCTx'  ***************************** -->
        <device Dname="STM32C092CCTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFP" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C092CCUx'  ***************************** -->
        <device Dname="STM32C092CCUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFN" n="48"/>
        </device>

        <!-- *************************  Device 'STM32C092KCTx'  ***************************** -->
        <device Dname="STM32C092KCTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFP" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C092KCUx'  ***************************** -->
        <device Dname="STM32C092KCUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFN" n="32"/>
        </device>

        <!-- *************************  Device 'STM32C092GCUx'  ***************************** -->
        <device Dname="STM32C092GCUx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="QFN" n="28"/>
        </device>

        <!-- *************************  Device 'STM32C092FCPx'  ***************************** -->
        <device Dname="STM32C092FCPx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00040000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_256.FLM" start="0x08000000" size="0x00040000" default="1" />
          <feature type="SOP" n="20"/>
        </device>

        <!-- ################################### 128 KB ################################## -->
        <!-- *************************  Device 'STM32C092RBTx'  ***************************** -->
        <device Dname="STM32C092RBTx">
          <memory name="Flash" access="rx"               start="0x08000000" size="0x00020000" default="1" startup="1" />
          <memory name="SRAM"  access="rwx"              start="0x20000000" size="0x00007800" default="1" />
          <algorithm name="CMSIS/Flash/STM32C0x_128.FLM" start="0x08000000" size="0x00020000" default="1" />
          <feature type="QFP" n="64"/>
        </device>

